src/main/java/br/com/infotera/it/tboholiday/newXMLDocument.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Credentials xmlns="http://TekTravel/HotelBookingApi" UserName="InfoteraTest" Password="Inf@64890970"/>
    </soap:Header>
    <soap:Body>
        <HotelBookRequest xmlns="http://TekTravel/HotelBookingApi">
            <ClientReferenceNumber>230420184646000#TBOH</ClientReferenceNumber>
            <GuestNationality>BR</GuestNationality>
            <Guests>
                <Guest LeadGuest="true" GuestType="Adult" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>CELISIO</FirstName>
                    <LastName>OLIVEIRA</LastName>
                    <Age>39</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Adult" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>ADERIO</FirstName>
                    <LastName>LESSA</LastName>
                    <Age>39</Age>
                </Guest>
                <Guest LeadGuest="false" GuestType="Child" GuestInRoom="1">
                    <Title>MR</Title>
                    <FirstName>ANSELMO</FirstName>
                    <LastName>SANTOS</LastName>
                    <Age>0</Age>
                </Guest>
            </Guests>
            <PaymentInfo VoucherBooking="true" PaymentModeType="Limit"/>
            <SessionId>e371a8db-c818-4400-b14f-3a56edd5abd7</SessionId>
            <NoOfRooms>1</NoOfRooms>
            <ResultIndex>1</ResultIndex>
            <HotelCode>1246193</HotelCode>
            <HotelName>Ibis Fujairah</HotelName>
            <HotelRooms>
                <HotelRoom>
                    <RoomIndex>1</RoomIndex>
                    <RoomTypeName>Twin Standard Room</RoomTypeName>
                    <RoomTypeCode>TW|2|1^^1^^16e880_234595205427_1_3_2_2_0_0_2916677638_6_2-6-0-8022170885791492183_25-100_30_2.20200518_1_2-1_0_30_1b27d76ae01f4084b655b564652f12b0_158767838100|2|1</RoomTypeCode>
                    <RatePlanCode>16e880_234595205427_1_3_2_2_0_0_2916677638_6_2-6-0-8022170885791492183_25-100_30_2.20200518_1_2-1_0_30_1b27d76ae01f4084b655b564652f12b0_158767838100|2|1</RatePlanCode>
                    <RoomRate RoomFare="69.99" RoomTax="0" TotalFare="69.99"/>
                </HotelRoom>
            </HotelRooms>
            <RestrictDuplicateBooking>true</RestrictDuplicateBooking>
        </HotelBookRequest>
    </soap:Body>
</soap:Envelope>
